Tekla Open API Reference for Tekla Structures 2025
PhaseCollection.Count Property
 Gets the number of elements contained in the ICollection.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection.Count
See Also
Reference
PhaseCollection Class
Tekla.Structures.Model Namespace